import math


def area(r):
    # Функция вычисляет площадь окружности

    # Функция принимает параметр r - радиус окружности

    # Функция возвращает площадь окружности

    #  Пример вызова: 
    #  input: area(10)
    #  output: 314,15927


    return math.pi * r * r


def perimeter(r):

    # Функция вычисляет длину окружности

    # Функция принимает параметр r - радиус окружности

    # Функция возвращает длину окружности

    #  Пример вызова: 
    #  input: perimeter(10)
    #  output: 62,83185

    return 2 * math.pi * r

