def area(a, b, c):
    # Функция вычисляет полупериметр треугольника

    # Функция принимает 3 параметра -
    # a - длинна первой стороны треугольника
    # b - длинна второй стороны треугольника
    # c - длинна третьей стороны треугольника

    # Функция возвращает полупериметр треугольника

    #  Пример вызова: 
    #  input: area(2,3,5)
    #  output: 5



    return (a + b + c) / 2


def perimeter(a, b, c):

    # Функция вычисляет периметр треугольника

    # Функция принимает 3 параметра -
    # a - длинна первой стороны треугольника
    # b - длинна второй стороны треугольника
    # c - длинна третьей стороны треугольника

    # Функция возвращает периметр треугольника

    #  Пример вызова: 
    #  input: area(2,3,5)
    #  output: 10
    return a + b + c
